var request = require('request');

/**
 * 验证码暂时没有破解，倒不是因为找不到打码平台，而是验证码和提交的请求不同步。没有深究因为太累了。
   其次本爬虫其实不算爬虫，是根据七次手工抓取的结果合并而成。
 */

// https://ks.wjx.top/m/23648800.aspx
// https://ks.wjx.top/joinnew/processjq.ashx?submittype=1&curID=23648800&t=1526513294645&starttime=2018%2F5%2F17%207%3A28%3A07&rn=2019716264.68741722&hmt=1&mst=3600

/**
var arr = []
Array.prototype.slice.call(document.querySelectorAll('.data__items'), 2).forEach(function (el) {
    try {
        var q = el.querySelector('.data__tit').innerText.match(/\d\.(.+)\s+/)[1].trim()
        var a = el.querySelector('.data__key').innerText.match(/\w.+/)[0]
        arr.push({ q,a })
    } catch (e) {
        console.log(el)
    }
})

JSON.stringify(arr)
*/

/*
var submitdata = `1$你的名字}2$你的手机号码}3$-2}4$-2}5$-2}6$-2}7$-2}8$-2}9$-2}10$-2}11$-2}12$-2}13$-2}14$-2}15$-2}16$-2}17$-2}18$-2}19$-2}20$-2}21$-2}22$-2}23$-2}24$-2}25$-2}26$-2}27$-2}28$-2}29$-2}30$-2`
var submitdata = `1$你的名字}2$你的手机号码}31$-2}32$-2}33$-2}34$-2}35$-2}36$-2}37$-2}38$-2}39$-2}40$-2}41$-2}42$-2}43$-2}44$-2}45$-2}46$-2}47$-2}48$-2}49$-2}50$-2}51$-2}52$-2}53$-2}54$-2}55$-2}56$-2}57$-2}58$-2}59$-2}60$-2}61$-2`
var submitdata = `1$你的名字}2$你的手机号码}62$-2}63$-2}64$-2}65$-2}66$-2}67$-2}68$-2}69$-2}70$-2}71$-2}72$-2}73$-2}74$-2}75$-2}76$-2}77$-2}78$-2}79$-2}80$-2}81$-2}82$-2}83$-2}84$-2}85$-2}86$-2}87$-2}88$-2}89$-2}90$-2}91$-2}92$-2`
var submitdata = `1$你的名字}2$你的手机号码}93$-2}94$-2}95$-2}96$-2}97$-2}98$-2}99$-2}100$-2}101$-2}102$-2}103$-2}104$-2}105$-2}106$-2}107$-2}108$-2}109$-2}110$-2}111$-2}112$-2}113$-2}114$-2}115$-2}116$-2}117$-2}118$-2}119$-2}120$-2`
var submitdata = `1$你的名字}2$你的手机号码}121$-2}122$-2}123$-2}124$-2}125$-2}126$-2}127$-2}128$-2}129$-2}130$-2}131$-2}132$-2}133$-2}134$-2}135$-2}136$-2}137$-2}138$-2}139$-2}140$-2}141$-2}142$-2}143$-2}144$-2}145$-2}146$-2}147$-2}148$-2}149$-2}150$-2`
var submitdata = `1$你的名字}2$你的手机号码}151$-2}152$-2}153$-2}154$-2}155$-2}156$-2}157$-2}158$-2}159$-2}160$-2}161$-2}162$-2}163$-2}164$-2}165$-2}166$-2}167$-2}168$-2}169$-2}170$-2}171$-2}172$-2}173$-2}174$-2}175$-2}176$-2}177$-2}178$-2}179$-2}180$-2`
var submitdata = `1$你的名字}2$你的手机号码}181$-2}182$-2}183$-2}184$-2}185$-2}186$-2}187$-2}188$-2}189$-2}190$-2}191$-2`
*/

var submitdata = `1$你的名字}2$你的手机号码}181$-2}182$-2}183$-2}184$-2}185$-2}186$-2}187$-2}188$-2}189$-2}190$-2}191$-2`

request({
    method: 'POST',
    uri: 'https://ks.wjx.top/joinnew/processjq.ashx?submittype=1&curID=23648800&t=1526513294645&starttime=2018%2F5%2F17%207%3A28%3A07&rn=2019716264.68741722&hmt=1&mst=3600',
    headers: 'application/x-www-form-urlencoded',
    form: {
        submitdata: submitdata
    }
}, function (err, _res, body) {
    if (err) console.log(err);
    console.log(body);
})
